SBIR_CFD_Phase_I/Configure/single_model/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform %InletVelocity%;

boundaryField
{
    Inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    Outlet
    {
        type            zeroGradient;    
    }
    ".*"
    {
        type            noSlip;
    }
	Ceil
	{
		type            symmetry;
	}
}


// ************************************************************************* //
