SBIR_CFD_Phase_I/Configure/single_model/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -3 0 0 0 0 ];

internalField   uniform %epsilon%;

boundaryField
{
    ".*"
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
    Inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    Outlet
    {
        type            zeroGradient;
    }
	Ceil
	{
		type            symmetry;
	}
}


// ************************************************************************* //
