SBIR_CFD_Phase_I/Configure/single_model/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform %nuTilda%;

boundaryField
{
    ".*"
    {
        type            nutkWallFunction;
        value           $internalField;
    }
	RiverBed
    {
        type            nutkRoughWallFunction;
        Ks              uniform %ks%;
        Cs              uniform 0.5;
        value           $internalField;
    }
    Inlet
    {
        type            calculated;
        value           $internalField;
    }
    Outlet
    {
        type                zeroGradient;
    }
	Ceil
	{
		type            symmetry;
	}
}


// ************************************************************************* //
