SBIR_CFD_Phase_I/Configure/single_model/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// these variables are set from the python scripts
NumX %NumX%;
NumY %NumY%;
NumZ %NumZ%;
MinX %MinX%;
MaxX %MaxX%;
MinY %MinY%;
MaxY %MaxY%;
MinZ %MinZ%;
MaxZ %MaxZ%;

vertices
(
    ( $MinX $MinY $MinZ )
    ( $MaxX $MinY $MinZ )
    ( $MaxX $MaxY $MinZ )
    ( $MinX $MaxY $MinZ )
    ( $MinX $MinY $MaxZ )
    ( $MaxX $MinY $MaxZ )
    ( $MaxX $MaxY $MaxZ )
    ( $MinX $MaxY $MaxZ )
);

blocks
(
	hex ( 0 1 2 3 4 5 6 7 ) ( $NumX $NumY $NumZ ) simpleGrading ( 1 1 1 )
);

edges
(
);

boundary
(
    Inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    Outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    RightWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    LeftWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    Floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    Ceil
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
